package com.ruoyi.activiti.constants;

/**
 * 监控事件单常量
 */
public class eventRunConstants {
    //一级标题（系统）
    public static final String ONELEVE_TITTLE="系统";
    //二级标题（标题）
    public static final String TWOLEVE_TITTLE=
            "采控平台告警," +
            "H3C硬件监控（合肥）," +
            "HP硬件监控（丰台亦庄合肥）," +
            "IBM硬件监控（丰台，合肥）," +
            "IB交换机（合肥）," +
            "中兴硬件监控（合肥）," +
            "华为硬件监控（亦庄，合肥）," +
            "日立硬件监控（丰台亦庄合肥）," +
            "曙光硬件监控（合肥）," +
            "浪潮硬件监控（丰台亦庄合肥）," +
            "烽火硬件监控（合肥）," +
            "基础资源监控," +
            "基础资源监控," +
            "基础资源监控," +
            "日志分析," +
            "NPM," +
            "网络监控报警," +
            "SNMP Trap," +
            "华三网管（丰台亦庄合肥）," +
            "应用告警接入（红色）," +
            "应用告警接入（部分红色+橙黄色）," +
            "应用日志脚本（红色）," +
            "应用日志脚本（橙黄色）," +
            "系统日志脚本," +
            "普罗米修斯," +
            "网络旁路告警接入(红色)," +
            "网络旁路告警接入（橙黄色）," +
            "集中应用监控API," +
            "知识查询";
    //三级标题（内容）
    public static final String THREELEVE_TITTLE=
            "交易量," +
            "交易耗时," +
            "交易环比," +
            "交易成功率," +
            "长时间无交易," +
            "交易流程," +
            "特殊日期说明(节假日没有交易牌价等)," +
            "特殊情况说明(节假日交易量少等)," +
            "自动恢复无需处理," +
            "转第三方处理（二线，关联系统,系统处）," +
            "文件收发/状态," +
            "日终时间/步骤/状态," +
            "消息收发/状态," +
            "作业任务时间/状态," +
            "文件处理(接收/发送/修改等)," +
            "日终处理(启动/停止/重置/报错处理/步骤跳过等)," +
            "作业任务处理(启动/停止/重置/步骤跳过等) ," +
            "消息处理( 接收/发送)," +
            "服务数/状态 ," +
            "服务队列长度/状态," +
            "应用进程数/状态," +
            "域链接数/状态," +
            "端口状态," +
            "空间使用率," +
            "服务处理 (启动/停止/重置等)," +
            "服务队列处理 (启动/停止/重置等)," +
            "应用进程处理 (启动/停止/重置等)," +
            "域链接处理 (启动/停止/重置等)," +
            "端口处理 (启动/停止/重置等)," +
            "空间清理(磁盘空间/表空间/内存空间/CPU空间清理等)," +
            "业务高峰期负载高," +
            "自动恢复无需处理（空间自动清理,域链接自动切换等）," +
            "业务类查询," +
            "月结/结息处理," +
            "自动恢复无需处理（业务自动处理,服务自动拉起,步骤自动跳过等）等）," +
            "脚本/日志结果," +
            "接口状态," +
            "日志处理(日志删除/备份等)," +
            "接口处理(启动/停止/重置等)," +
            "月初月末作业跑批慢";
    //值班角色
    public static final String DUTY_ROLE="6211";
    //数据中心
    public static final String DATA_CENTER="0010";
    //厂商人员
    public static final String MANUFACTURER="0002";
    //工作组类型
    public static final String GROUP_TYPE_SYS="3";
    public static final String GROUP_TYPE_WEB="4";
    //默认发起人
    public static final String USERID="4028c485295d85d401295e671ca704a8";
}
